/*
   Localizable.strings - Swedish
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Ja";
"No" = "Nej";
"Ok" = "Ok";
"Cancel" = "Avbryt";
"Close" = "Stäng";
"Save" = "Spara";
"Delete" = "Ta bort";
"Rename" = "Byt namn";
"Extract" = "Extrahera";
"Cut" = "Klipp ut";
"Paste" = "Klistra in";
"Create" = "Skapa";
"Reset" = "Återställ";

/* Common States */
"Loading" = "Laddar";
"Extracting" = "Extraherar";
"Seeking" = "Söker";
"Seeking %d%%" = "Söker %d%%";
"Refreshing" = "Uppdaterar";
"Browsing" = "Bläddrar";
"Cancelling..." = "Avbryter...";

/* Common Messages */
"Error" = "Fel";
"OK" = "OK";
"Warning" = "Varning";
"Do you want to reset to default value:\n" = "Vill du återställa till standardvärde:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Lokal bläddring";
"Browser_LocalBrowsing_SubKey" = "Bläddra, spela & ta bort lokala filer.";

"Browser_MODLAND_MainKey" = "MODLAND-samling";
"Browser_MODLAND_SubKey" = "%d nedladdningsbara filer.";

"Browser_HVSC_MainKey" = "HVSC-samling";
"Browser_HVSC_SubKey" = "%d nedladdningsbara filer.";

"Browser_Playlists_MainKey" = "Spellistor";
"Browser_Playlists_SubKey" = "Organisera, skapa, ta bort & lyssna.";

"Browser_Favorites_MainKey" = "Favoriter";
"Browser_Favorites_SubKey" = "Lyssna på betygsatta låtar.";

"Browser_Most_played_MainKey" = "Mest spelade";
"Browser_Most_played_SubKey" = "Lyssna på mest spelade låtar.";

"Browser_Web_MainKey" = "Webb";
"Browser_Web_SubKey" = "Surfa på internet & ladda ner musik.";

"Browser_WorldCharts_MainKey" = "Världslistor";
"Browser_WorldCharts_SubKey" = "Topplistor & nedladdningslänkar.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Videospelsmusik";

"Browser_UserGuide_MainKey" = "Användarguide";
"Browser_UserGuide_SubKey" = "Manual, FAQ, tips.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Hämta alla saknade poster";
"GetAllEntries_SubKey" = "Begränsat till 256 första saknade poster.";

"DisplayAll_MainKey" = "Lista alla sorterade efter namn";
"DisplayAll_SubKey" = "Aktuell mapp:";

"DisplayDir_MainKey" = "Lista/Mapp";
"DisplayDir_SubKey" = "Alla sorterade efter sökväg:";

"DisplayAllPath_MainKey" = "Lista alla sorterade efter sökväg";
"DisplayAllPath_SubKey" = "Alla sorterade efter namn:";

/* Browser View Modes */
"Formats/Artists/Files" = "Format/Artister/Filer";
"Artists/Formats/Files" = "Artister/Format/Filer";
"Artists/Files" = "Artister/Filer";
"Formats: %d entries." = "Format: %d poster.";
"Artists: %d entries." = "Artister: %d poster.";

/* Browser Stats */
"Played %d times." = "Spelad %d gånger.";
"Played once." = "Spelad en gång.";
"Never played." = "Aldrig spelad.";
"%d files." = "%d filer.";
"1 file." = "1 fil.";
"Size: %dKB" = "Storlek: %dKB";

/* Browser Messages */
"Browser not enough mem." = "För många poster, kan inte allokera minne.";
"Browser not enough mem. Limited." = "För många poster, kan inte allokera minne. Listan är ofullständig.";

/* File Operations */
"New folder" = "Ny mapp";
"Enter folder name" = "Ange mappnamn";
"Nothing to paste" = "Inget att klistra in";
"No file to extract or not supported archive format.\n" = "Ingen fil att extrahera eller arkivformatet stöds ej.\n";
"Cannot use iCloud as folder name" = "Kan inte använda iCloud som mappnamn";

"Issue %d while trying to delete entry.\n%@" = "Problem %d vid försök att ta bort post.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problem %d vid försök att byta namn på fil.\n%@";
"Issue %d while moving: %@.\n%@" = "Problem %d vid flyttning: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problem %d vid skapande av mapp\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Filen är inte tillgänglig lokalt.\nStartar nedladdning från iCloud, kontrollera i 'Filer'-appen.";

"unavailable" = "otillgänglig";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Spellista (%d)";
"Playlist/Search off" = "Spellista/Sökning av";

"Local (%d, limited to %d)" = "Lokal (%d, begränsad till %d)";
"Local (%d)" = "Lokal (%d)";
"Local/Search off" = "Lokal/Sökning av";

"Modland (%d, limited to %d)" = "Modland (%d, begränsad till %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Sökning av";

"HVSC (%d, limited to %d)" = "HVSC (%d, begränsad till %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Sökning av";

"ASMA (%d, limited to %d)"="ASMA (%d, begränsad till %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Sökning av";

/* Search Messages */
"Searching Playlists..." = "Söker i spellistor...";
"Searching Local files..." = "Söker i lokala filer...";
"Searching MODLAND..." = "Söker i MODLAND...";
"Searching HVSC..." = "Söker i HVSC...";

"Please enter at least 2 characters for your search." = "Ange minst 2 tecken för din sökning.";
"Please activate at least 1 section for your search." = "Aktivera minst 1 sektion för din sökning.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Spelar nu";
"Now playing(%d)" = "Spelar nu(%d)";
"Most played" = "Mest spelade";
"Favorites" = "Favoriter";
"Resuming last\nplayed file" = "Återupptar senast\nspelade fil";

/* Player Controls */
"Previous" = "Föregående";
"Previous file" = "Föregående fil";
"Next file" = "Nästa fil";
"Next" = "Nästa";
"Shuffle" = "Blanda";
"Voices control" = "Röstkontroll";
"All voices" = "Alla röster";
"Clear 'Now Playing' queue" = "Rensa 'Spelar nu'-kö";

/* Song Selection */
"Choose a subsong" = "Välj en dellåt";
"Choose a song" = "Välj en låt";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Inget spelas för närvarande. Välj en fil.";
"File cannot be played. Skipping to next playable file." = "Filen kan inte spelas. Hoppar till nästa spelbar fil.";
"Too much entries! Playlist will be limited to %d first entries." = "För många poster! Spellistan begränsas till %d första poster.";
"Playlist is full. Delete some entries to add more." = "Spellistan är full. Ta bort några poster för att lägga till fler.";

/* Metadata */
"unknown_title" = "Okänd titel";
"unknown_album" = "Okänt album";
"now_playing_format" = "Spelar: %@ från %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Ny spellista";
"Create new playlist" = "Skapa ny spellista";
"Save current one" = "Spara aktuell";
"Rename playlist" = "Byt namn på spellista";
"Add to a playlist" = "Lägg till i spellista";
"Choose a playlist" = "Välj en spellista";

/* Playlist Descriptions */
"Create a new empty playlist." = "Skapa en ny tom spellista.";
"Create a playlist from currently played files." = "Skapa en spellista från aktuellt spelade filer.";
"Browse files" = "Bläddra i filer";
"Add or remove entries from browser." = "Lägg till eller ta bort poster från webbläsare.";
"Choose a new name." = "Välj ett nytt namn.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Är du säker på att du vill ta bort denna spellista?";
"Are you sure you want to delete this entry ?" = "Är du säker på att du vill ta bort denna post?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Nedladdningar";
"Download queue: 1 file" = "Nedladdningskö: 1 fil";
"Download queue: %d files" = "Nedladdningskö: %d filer";
"No download in progress" = "Ingen nedladdning pågår";
"Downloaded %@" = "Nedladdat %@";
"Downloading %@" = "Laddar ner %@";
"Cannot download from this URL." = "Kan inte ladda ner från denna URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Kunde inte lägga till filer. Kontrollera manuellt med filhanterare (Lokal bläddring/Nedladdningar).";
"File already available locally. Do you want to download it again?" = "Filen är redan tillgänglig lokalt. Vill du ladda ner den igen?";
"URL have to start with ftp:// or http://" = "URL måste börja med ftp:// eller http://";
"Cannot connect to FTP." = "Kan inte ansluta till FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Databas skapad.";
"Database will now be recreated. Please validate & wait." = "Databasen kommer nu att återskapas. Bekräfta & vänta.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Fel databasversion: %d.%d. Kommer att uppdatera till %d.%d. Bekräfta & vänta.";
"No database found. Will create a new one. Please validate & wait..." = "Ingen databas hittades. Kommer att skapa en ny. Bekräfta & vänta...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Bild upptäckt";
"Choose_SaveCover" = "Spara bild som omslag för %@?";
"CoverFolder" = "Som mappomsla";
"CoverFile" = "Som filomslag";
"Confirm_RemCurCovers" = "Ta bort aktuella omslag för %@ (mapp & fil)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Allmänt";
"Settings_Player" = "Spelare";
"Settings_Display" = "Visning";
"Settings_Download" = "Nedladdning";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Uppspelningsbibliotek";
"Settings_Settings" = "Inställningar";

/* Settings Presets */
"Settings_SettingsDefault" = "Standard";
"Settings_SettingsHigh" = "Hög";
"Settings_SettingsMed" = "Medel";
"Settings_SettingsLow" = "Låg";

"Confirm_SettingsDef" = "Är du säker på att du vill återställa inställningar till 'standard'-värden?";
"Confirm_SettingsHigh" = "Är du säker på att du vill återställa inställningar till 'höga' värden?";
"Confirm_SettingsMed" = "Är du säker på att du vill återställa inställningar till 'medel'-värden?";
"Confirm_SettingsLow" = "Är du säker på att du vill återställa inställningar till 'låga' värden?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Sök: förenklat regexp ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Återuppta position vid start";
"Notification" = "Avisering";
"Notification duration" = "Aviseringstid";
"Disable screen auto lock" = "Inaktivera automatisk skärmlåsning";
"No screen auto lock" = "Ingen automatisk skärmlåsning";
"Enable playback ratio" = "Aktivera uppspelningsförhållande";
"Playback ratio" = "Uppspelningsförhållande";
"Default length" = "Standardlängd";
"Default length %d:%.2d" = "Standardlängd %d:%.2d";
"Fade-out time" = "Uttoning";
"Silence Detection" = "Tystnadsdetektering";
"Stop song if silent for more than selected number of seconds. 0: off" = "Stoppa låt om tyst längre än valt antal sekunder. 0: av";
"Will skip song if nothing is played for specified duration (0=off)" = "Hoppar över låt om inget spelas under angiven tid (0=av)";
"Force mono" = "Tvinga mono";
"Panning" = "Panorering";
"Panning value" = "Panoreringsvärde";
"Audio latency" = "Ljudlatens";
"Audio latency in ms" = "Ljudlatens i ms";
"Multi default action" = "Standardåtgärd för flera";
"Browse" = "Bläddra";
"Archive/multi play mode" = "Arkiv/fleruppspelningsläge";
"Entry"="Post";

/* Archive Settings */
"Archive multi default action" = "Standardåtgärd för arkiv";
"Archive multi play mode" = "Fleruppspelningsläge för arkiv";

/* Playlist Settings */
"Play/Enqueue action" = "Spela/Kölägg åtgärd";
"Enqueue mode" = "Köläge";
"Default Action" = "Standardåtgärd";
"Play" = "Spela";
"Enqueue" = "Kölägg";
"Enq.&Play" = "Kölägg & spela";
"First" = "Första";
"Current" = "Aktuell";
"Last" = "Sista";
"Enqueue position" = "Köposition";
"Post download action" = "Åtgärd efter nedladdning";
"Nothing" = "Inget";

/* Display Settings */
"Background mode" = "Bakgrundsläge";
"Partial" = "Delvis";
"Full" = "Full";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Av=ingen bakgrundsprocess, Delvis=fortsätt spela musik, Full=håll app igång i bakgrund";
"Long name truncate" = "Avkortning av långa namn";
"Head" = "Början";
"Mid." = "Mitt";
"Tail" = "Slut";
"Filename as title" = "Filnamn som titel";

/* Local Files Settings */
"Auto. restore Samples folder" = "Återställ Samples-mapp automatiskt";
"Send statistics" = "Skicka statistik";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Databas";
"Settings_CleanDB" = "Rensa databas";
"Settings_ResetPlCnt" = "Återställ spelräknare";
"Settings_ResetRatings" = "Återställ betyg";
"Settings_ResetDB" = "Återställ hela databasen";

"Confirm_DBClean" = "Starta databasrensning (kan ta en stund)?";
"Confirm_Reset_PlCnt" = "Är du säker på att du vill återställa alla spelräknare?";
"Confirm_Reset_Ratings" = "Är du säker på att du vill återställa alla betyg?";
"Confirm_ResetDB" = "Är du säker på att du vill återställa hela databasen? Spellistor, betyg, räknare kommer att tas bort.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Lokala filer";
"Settings_RecreateSamples" = "Återskapa 'Samples'-mapp";
"Settings_FormatDownloads" = "Formatera 'Nedladdningar'-mapp";
"Settings_RemCovers" = "Ta bort omslag";
"Settings_UpdateFilesBackupFlag" = "Kontrollera filsystem";

"Confirm_RecreateSamples" = "Vill du återskapa 'Samples'-mappen?";
"Confirm_FormatDownloads" = "Vill du ta bort ALLA filer från Lokal bläddring/Webb-mapp?";
"Confirm_CheckFiles" = "Vill du utföra lokal filsystemkontroll?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "OPL-typ";
"Stereo surround" = "Stereo surround";

/* GBSPlay */
"HP filter type" = "HP-filtertyp";
"Highpass filter type" = "Högpassfiltertyp";

/* Game Music Emu (GME) */
"Stereo separation" = "Stereoseparation";
"Ignore silence" = "Ignorera tystnad";
"Silence detection" = "Tystnadsdetektering";
"Equalizer" = "Equalizer";
"Bass" = "Bas";
"Treble" = "Diskant";

/* GSF */
"Sound quality" = "Ljudkvalitet";
"Interpolation" = "Interpolering";
"Low-pass filter" = "Lågpassfilter";
"Echo" = "Eko";

/* Highly Complete (HC) */
"Resample quality" = "Omsamplad kvalitet";
"Main enabled" = "Huvudaktiverad";
"Reverb enabled" = "Reverb aktiverad";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAY standardlängd";
"LPF strength" = "LPF-styrka";
"Min=off, default: 112" = "Min=av, standard: 112";
"HPF strength" = "HPF-styrka";
"Region" = "Region";
"VRC7 Patches" = "VRC7-patchar";
"Force IRQ" = "Tvinga IRQ";
"Quality" = "Kvalitet";

/* OpenMPT */
"Master volume" = "Huvudvolym";
"Sampling" = "Sampling";
"Resampling" = "Omsampling";

/* SID */
"Engine" = "Motor";
"Filter" = "Filter";
"Force loop" = "Tvinga loop";
"Clock" = "Klocka";
"Model" = "Modell";
"Force 2nd SID" = "Tvinga 2:a SID";
"Address 2nd" = "Adress 2:a";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF eller 0xDE00-0xDFFF";
"Force 3rd SID" = "Tvinga 3:e SID";
"Address 3rd" = "Adress 3:e";

/* Timidity */
"Max loop" = "Max loop";
"MIDI polyphony" = "MIDI-polyfoni";
"Amplification" = "Förstärkning";
"Chorus" = "Kör";
"Reverb" = "Reverb";
"Resample" = "Omsampla";
"LP filter" = "LP-filter";

/* UADE */
"Headphones" = "Hörlurar";
"LED filter" = "LED-filter";
"Normalization" = "Normalisering";
"Post FX" = "Post-FX";
"Panning" = "Panorering";
"Panning value" = "Panoreringsvärde";
"Gain" = "Förstärkning";
"Gain value" = "Förstärkningsvärde";
"Force NTSC" = "Tvinga NTSC";

/* VGMPlay */
"Prefer JTAG" = "Föredra JTAG";
"YM2612 emulator" = "YM2612-emulator";
"Nuked OPN2 option" = "Nuked OPN2-alternativ";
"YMF262 emulator" = "YMF262-emulator";
"YM3812 emulator" = "YM3812-emulator";
"QSound emulator" = "QSound-emulator";
"RF5C68 emulator" = "RF5C68-emulator";

/* VGMStream */
"Max loop" = "Max loop";

/* XMP */
"Amiga 500 Filter" = "Amiga 500-filter";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "FX-alfa";
"FX Fullscreen" = "FX helskärm";
"FX FPS" = "FX FPS";
"FX show info" = "FX visa info";
"Tech Info" = "Teknisk info";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Visa FPS och annan info (CPU, upplösning, ProjectM-ljuddata)";
"FX Level of details" = "FX-detaljnivå";
"Low" = "Låg";
"Med" = "Medel";
"High" = "Hög";
"Slow FX limit" = "Långsam FX-gräns";
"Deactivate FX if too slow." = "Inaktivera FX om för långsam.";
"Weak" = "Svag";
"Strong" = "Stark";
"Display song info" = "Visa låtinfo";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "När i helskärm, visa låtinfo när den ändras. TL är uppe till vänster, DR är nere till höger, C är centrum.";

/* ProjectM */
"ProjectM settings" = "ProjectM-inställningar";
"ProjectM on/off" = "ProjectM på/av";
"Show preset label" = "Visa förinställningsetikett";
"Auto switch presets mode" = "Automatiskt byte av förinställningar";
"Lock preset" = "Lås förinställning";
"Time between preset" = "Tid mellan förinställningar";
"Blend presets" = "Blanda förinställningar";
"Blend time" = "Blandningstid";
"Bundled presets" = "Medföljande förinställningar";
"Custom presets" = "Anpassade förinställningar";
"Aspect ratio" = "Bildförhållande";
"Mesh size X" = "Mesh-storlek X";
"Mesh size Y" = "Mesh-storlek Y";
"Hard cut enabled" = "Hårt klipp aktiverat";
"Hard cut min time" = "Hårt klipp min tid";
"Hard cut sensitivity" = "Hårt klipp känslighet";
"Beat sensitivity" = "Takt känslighet";
"Permissive mode" = "Tillåtande läge";

/* Oscilloscope */
"Oscillo settings" = "Oscilloskop-inställningar";
"FX mode" = "FX-läge";
"Show label" = "Visa etikett";
"Label font size" = "Etikettens teckenstorlek";
"Show grid" = "Visa rutnät";
"Grid color" = "Rutnätsfärg";
"Line width" = "Linjebredd";
"Mono color" = "Monofärg";
"Multi color set" = "Flerfärgset";
"Reset all colors" = "Återställ alla färger";
"Thin" = "Tunn";
"Medium" = "Medel";
"Thick" = "Tjock";
"Beefy" = "Kraftig";

/* Piano Roll / MIDI */
"Piano roll" = "Pianorulle";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Aktivera pianorulle-FX, standard eller 'Synthesia'-stil";
"Activate spark FX, colored or white" = "Aktivera gnist-FX, färgad eller vit";
"Display voices labels" = "Visa röstetiketter";
"Display octaves labels" = "Visa oktavetiketter";
"MIDI pattern" = "MIDI-mönster";
"MIDI cut line" = "MIDI-skärlinje";
"MIDI bar style" = "MIDI-stapler stil";
"MIDI bar vibrato" = "MIDI-stapler vibrato";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Piano-skärlinje";
"Piano color mode" = "Piano-färgläge";

/* Spectrum */
"3D spectrum" = "3D-spektrum";
"3D spectrum bloom" = "3D-spektrum bloom";
"Spectrum" = "Spektrum";
"3D landscape" = "3D-landskap";
"3D landscape bloom" = "3D-landskap bloom";

/* MOD Pattern */
"MOD pattern" = "MOD-mönster";
"MOD pattern BG alpha" = "MOD-mönster BG alfa";
"MOD pattern vol bar" = "MOD-mönster volymstapel";
"MOD pattern current line mode" = "MOD-mönster aktuell linjemodus";
"MOD pattern font" = "MOD-mönster teckensnitt";
"MOD pattern font size" = "MOD-mönster teckenstorlek";
"MOD pattern theme" = "MOD-mönster tema";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Välkommen till Modizers webbläsare!</b><br><br>Använd adressfältet ovan för att navigera eller utforska dina bokmärken.<br><br>För att använda en bild som omslag, kopiera den till urklipp med ett långt tryck (iOS) eller högerklick (macOS).";
"Bookmarks" = "Bokmärken";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.2 © Yohann Magnien / YoyoFR\n\nKontakt: mailto:modizerhelp@gmail.com\nWebb: https://modizer.app\n\nModizers logotyp av Steve Miele.\n\nAntal filformat/filändelser som stöds: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nIntegrerade spelarbibliotek:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(använder Merlin_gold SF2 soundfont)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nFriskrivningsklausul:\nInternetåtkomst till Modland-, HVSC- & ASMA-biblioteken tillhandahålls som en tjänst i befintligt skick, garanti för tillgänglighet och/eller funktionalitet ges ej. Använd denna app på egen risk.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "E-postsupport";
"Contact support by email" = "Kontakta support via e-post";
"[Please describe your request below]" = "[Beskriv din förfrågan nedan]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Tack! ❤️";
"Send a tip to Modizer" = "Skicka dricks till Modizer";
"Support Modizer development" = "Stöd Modizer-utveckling";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Rensar DB & \nåterställer inställningar";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Första start eller problem uppstod förra gången Modizer kördes. Tillämpa standardinställningar?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Intent-titlar */
"Play" = "Spela";
"Pause" = "Pausa";
"Stop" = "Stoppa";
"Next Song" = "Nästa låt";
"Previous Song" = "Föregående låt";
"Play Subsong" = "Spela underlåt";
"Seek" = "Sök";
"Set Infinite Loop" = "Ställ in oändlig loop";
"Set Loop Mode" = "Ställ in upprepningsläge";
"Set Shuffle Mode" = "Ställ in blandningsläge";
"Toggle Shuffle" = "Växla blandning";
"Toggle Loop Mode" = "Växla upprepningsläge";
"Set Fullscreen mode" = "Ställ in helskärmsläge";
"Go the player view" = "Gå till spelarvy";
"Set FX" = "Ställ in FX";
"Get Now Playing" = "Hämta nu spelar";
"Get Playlists" = "Hämta spellistor";
"Play some music" = "Spela musik";
"Play most played" = "Spela mest spelade";
"Play favorites" = "Spela favoriter";
"Play Playlist" = "Spela spellista";
"Play Playlist By Name" = "Spela spellista efter namn";

/* Intent-beskrivningar */
"Starts playing music in Modizer." = "Startar musikuppspelning i Modizer.";
"Pauses music playback in Modizer." = "Pausar musikuppspelning i Modizer.";
"Stops music playback in Modizer." = "Stoppar musikuppspelning i Modizer.";
"Skips to the next song in Modizer." = "Hoppar till nästa låt i Modizer.";
"Skips to the previous song in Modizer." = "Hoppar till föregående låt i Modizer.";
"Plays a specific subsong in the current file." = "Spelar en specifik underlåt i den aktuella filen.";
"Seeks to a specific position in the current song." = "Söker till en specifik position i den aktuella låten.";
"Set the infinite loop mode in Modizer." = "Ställer in oändlig loop-läge i Modizer.";
"Set the loop mode in Modizer." = "Ställer in upprepningsläge i Modizer.";
"Set the shuffle mode in Modizer." = "Ställer in blandningsläge i Modizer.";
"Toggles shuffle mode in Modizer." = "Växlar blandningsläge i Modizer.";
"Toggles loop mode in Modizer." = "Växlar upprepningsläge i Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Aktiverar eller inaktiverar helskärmsläge i Modizer.";
"Go the player view in Modizer." = "Går till spelarvyn i Modizer.";
"Set FX mode in Modizer." = "Ställer in FX-läge i Modizer.";
"Gets information about the currently playing song." = "Hämtar information om den aktuellt spelande låten.";
"Gets the list of available playlists in Modizer." = "Hämtar listan över tillgängliga spellistor i Modizer.";
"Random picks from available local titles in Modizer." = "Slumpmässiga val från tillgängliga lokala titlar i Modizer.";
"Most played titles from available local titles in Modizer." = "Mest spelade titlar från tillgängliga lokala titlar i Modizer.";
"Favorites titles from available local titles in Modizer." = "Favorittitlar från tillgängliga lokala titlar i Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Spelar en specifik spellista i Modizer. Obs: För bästa resultat med röstkommandon, använd 'Spela spellista efter namn' istället.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Spelar en spellista efter namn i Modizer. Rekommenderas för röstkommandon.";

/* Parametrar */
"Subsong Index" = "Underlåtsindex";
"The index of the subsong to play" = "Indexet för underlåten som ska spelas";
"Position (seconds)" = "Position (sekunder)";
"The position to seek to in seconds" = "Positionen att söka till i sekunder";
"Relative" = "Relativ";
"Whether to seek relative to current position" = "Om sökning ska vara relativ till nuvarande position";
"Infinite Loop Mode" = "Oändligt loop-läge";
"0: off, 1: infinite loop" = "0: av, 1: oändlig loop";
"Repeat Mode" = "Upprepningsläge";
"0: off, 1: loop current title, 2: loop playlist" = "0: av, 1: upprepa aktuell titel, 2: upprepa spellista";
"Shuffle Mode" = "Blandningsläge";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: av, 1: välj endast en titel om filen har underlåtar eller är ett arkiv, 2: spela alla titlar i en given fil";
"Fullscreen mode" = "Helskärmsläge";
"Activate (1) or disactivate (0) Fullscreen mode" = "Aktivera (1) eller inaktivera (0) helskärmsläge";
"FX" = "FX";
"The FX to set" = "FX att ställa in";
"FX Mode" = "FX-läge";
"The mode to activate for the selected FX (0:off)" = "Läget att aktivera för vald FX (0:av)";
"Playlist" = "Spellista";
"The playlist to play" = "Spellistan att spela";
"Start Index" = "Startindex";
"The index of the song to start playing from (0-based)" = "Indexet för låten att börja spela från (0-baserat)";
"Playlist Name" = "Spellistanamn";
"The name of the playlist to play" = "Namnet på spellistan att spela";
"Which playlist would you like to play?" = "Vilken spellista vill du spela?";

/* Dialogmeddelanden */
"play_playlist_dialog" = "Spelar spellista %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Spellista hittades inte. Använd 'Hämta spellistor' för att se tillgängliga spellistor.";
"No playlists found" = "Inga spellistor hittades";

/* FX-namn */
"ProjectM" = "ProjectM";
"Oscillo" = "Oscilloskop";
"Piano roll" = "Pianorulle";
"3D Piano" = "3D-piano";
"Notes bars" = "Notstaplar";
"Tracker" = "Tracker";
"2D Spectrum" = "2D-spektrum";
"3D Spectrum" = "3D-spektrum";
"3D Landscape" = "3D-landskap";

// ================================

"Get Now Playing" = "Hämta Spelar nu";
"Which playlist would you like to play?" = "Vilken spellista vill du spela?";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "Röstkommandon";
"Siri voice commands for Modizer" = "Siri-röstkommandon för Modizer";
"Voice Commands: Playback" = "Uppspelning";
"Voice Commands: Navigation" = "Navigering";
"Voice Commands: Playlists" = "Spellistor";
"Voice Commands: Modes" = "Lägen";
// MARK: - TABS
// ================================

"Search" = "Sök";
"More" = "Mer";
"Suspend" = "Pausa";
"Clear all" = "Rensa alla";
"Online" = "Online";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "Om";
"Some general informations" = "Allmän information";
"Settings" = "Inställningar";
"Global, Visu, FTP & Plugins" = "Globala, Visu, FTP & Tillägg";
"Maintenance" = "Underhåll";
"Clean DB, Reset ratings, ..." = "Rensa DB, Återställ betyg, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Samlingar";
"Browse Internet" = "Surfa på internet";
"Games Music" = "Spelmusik";
"Mods & chiptunes" = "Mods & chiptunes";
"Other" = "Annat";

/* Collections */
"MODLAND collection" = "MODLAND-samling";
"HVSC collection" = "HVSC-samling";
"ASMA collection" = "ASMA-samling";
"JOSHW collection" = "JOSHW-samling";
"VGMRips collection" = "VGMRips-samling";
"SNESmusic collection" = "SNESmusic-samling";
"SMS Power! collection" = "SMS Power!-samling";
"ZXArt collection" = "ZXArt-samling";

/* Collection Descriptions */
"%d entries" = "%d poster";
"Thousands of entries" = "Tusentals poster";
"2K+ packs / 40K+ songs" = "2K+ paket / 40K+ låtar";
"1500+ sets / Super Nintendo/Famicom" = "1500+ set / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Master System & Game Gear-set";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Modizer Världslistor";
"Web browser" = "Webbläsare";
"No internet connectivity or website down." = "Ingen internetanslutning eller webbplatsen är nere.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Globala";
"Default Players" = "Standardspelare";
"Visualizers" = "Visualiserare";
"PR & NS colors settings" = "PR & NS färginställningar";
"Plugins" = "Tillägg";

/* Player Selection */
"MOD player" = "MOD-spelare";
"SAP player" = "SAP-spelare";
"SID player" = "SID-spelare";
"VGM player" = "VGM-spelare";
"YM player" = "YM-spelare";
"NSF player" = "NSF-spelare";
"PT3 player" = "PT3-spelare";
"GBS player" = "GBS-spelare";
"KSS player" = "KSS-spelare";
"2SF player" = "2SF-spelare";
"MIDI player" = "MIDI-spelare";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Endast för tillägg som stöder denna funktion (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, fördröjning avrundad till multipel av ljudbufferstorlek";
"Limited: not for subsong" = "Begränsat: ej för dellåt";
"Default value is 3s" = "Standardvärde är 3s";
"Default action when selecting an archive or a multisong file" = "Standardåtgärd vid val av arkiv eller flerfaldig låt";
"Play only selected entry or full archive/multisong file" = "Spela endast vald post eller helt arkiv/flerfaldig låt";
"Show Welcome screen" = "Visa välkomstskärm";
"Adplug priority for module" = "Adplug-prioritet för modul";

/* FTP Settings */
"Server status" = "Serverstatus";
"FTP Server" = "FTP-server";
"Authorize anonymous" = "Tillåt anonym";
"User" = "Användare";
"Password" = "Lösenord";
"Port" = "Port";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "HVSC URL";
"ASMA URL" = "ASMA URL";
"MODLAND Server" = "MODLAND-server";
"MODLAND cust.URL" = "MODLAND anp.URL";
"HVSC Server" = "HVSC-server";
"HVSC cust.URL" = "HVSC anp.URL";
"ASMA Server" = "ASMA-server";
"ASMA cust.URL" = "ASMA anp.URL";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Mönster BG-alfa";
"Opacity of mod patterns view" = "Opacitet för mod-mönstervy";
"MOD Color Theme" = "MOD-färgtema";
"MOD Current Line" = "MOD aktuell linje";
"MOD Volume bars" = "MOD volymstaplar";
"MOD Pattern Font" = "MOD-mönster teckensnitt";
"MOD Pattern Font Size" = "MOD-mönster teckenstorlek";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "Pianorulle-FX";
"PR/Spark FX" = "PR/Gnist-FX";
"Display voices label" = "Visa röstetiketter";
"Notes scroller FX" = "Notrullnings-FX";
"NS/bars mode" = "NS/stapler läge";
"NS/bars style" = "NS/stapler stil";
"Vibrato display" = "Vibrato-visning";
"Piano FX" = "Piano-FX";
"Piano bars mode" = "Piano stapler läge";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3D Sp.Bloom";
"3D Land. Bloom" = "3D Land. Bloom";
"0: off" = "0: av";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM-FX";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Renderingskvalitet: Max är pixelupplösning, 1/2 är halv, ...";
"Custom presets/textures should be copied in .projectm folder" = "Anpassade förinställningar/texturer ska kopieras till .projectm-mapp";
"Display preset name" = "Visa förinställningens namn";
"Lim: display and disappear quickly" = "Begr: visa och försvinn snabbt";
"Auto switch presets" = "Automatiskt byte av förinställningar";
"Allow loading of milk file with script issues" = "Tillåt laddning av milk-fil med skriptproblem";
"Default is 15s" = "Standard är 15s";
"Default is 2.7s" = "Standard är 2.7s";
"Default value is 32" = "Standardvärde är 32";
"Default value is 24" = "Standardvärde är 24";
"Default value is 20" = "Standardvärde är 20";
"Hardcut" = "Hårt klipp";
"Hardcut triggers presets switch synchronized with beats." = "Hårt klipp utlöser byte av förinställningar synkroniserat med takt.";
"Hardcut min time" = "Hårt klipp min tid";
"Preserve aspect ratio for compatible shaders." = "Bevara bildförhållande för kompatibla shaders.";
"Default value is 1" = "Standardvärde är 1";
"Hardcut sensitivity" = "Hårt klipp känslighet";

/* Oscilloscope Settings */
"Oscillo FX" = "Oscilloskop-FX";
"Oscillo show labels" = "Oscilloskop visa etiketter";
"Oscillo labels font size" = "Oscilloskop etiketter teckenstorlek";
"Oscillo show grid" = "Oscilloskop visa rutnät";
"Oscillo line width" = "Oscilloskop linjebredd";
"Reset all custom colors" = "Återställ alla anpassade färger";
"Multi color | System 1" = "Flerfärg | System 1";
"Multi color | System 2" = "Flerfärg | System 2";
"Multi color | System 3" = "Flerfärg | System 3";
"Multi color | System 4" = "Flerfärg | System 4";
"Multi color | System 5" = "Flerfärg | System 5";
"Multi color | System 6" = "Flerfärg | System 6";
"Multi color | System 7" = "Flerfärg | System 7";
"Multi color | System 8" = "Flerfärg | System 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Anpassad färg 01";
"Custom color 02" = "Anpassad färg 02";
"Custom color 03" = "Anpassad färg 03";
"Custom color 04" = "Anpassad färg 04";
"Custom color 05" = "Anpassad färg 05";
"Custom color 06" = "Anpassad färg 06";
"Custom color 07" = "Anpassad färg 07";
"Custom color 08" = "Anpassad färg 08";
"Custom color 09" = "Anpassad färg 09";
"Custom color 10" = "Anpassad färg 10";
"Custom color 11" = "Anpassad färg 11";
"Custom color 12" = "Anpassad färg 12";
"Custom color 13" = "Anpassad färg 13";
"Custom color 14" = "Anpassad färg 14";
"Custom color 15" = "Anpassad färg 15";
"Custom color 16" = "Anpassad färg 16";
"Custom color 17" = "Anpassad färg 17";
"Custom color 18" = "Anpassad färg 18";
"Custom color 19" = "Anpassad färg 19";
"Custom color 20" = "Anpassad färg 20";
"Custom color 21" = "Anpassad färg 21";
"Custom color 22" = "Anpassad färg 22";
"Custom color 23" = "Anpassad färg 23";
"Custom color 24" = "Anpassad färg 24";
"Custom color 25" = "Anpassad färg 25";
"Custom color 26" = "Anpassad färg 26";
"Custom color 27" = "Anpassad färg 27";
"Custom color 28" = "Anpassad färg 28";
"Custom color 29" = "Anpassad färg 29";
"Custom color 30" = "Anpassad färg 30";
"Custom color 31" = "Anpassad färg 31";
"Custom color 32" = "Anpassad färg 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Hoppar över låt om inget spelas under angiven tid (0=av)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Standardlängd";
"Oversampling. Min=0, default: 10" = "Översampling. Min=0, standard: 10";
"Min=off, default: 112" = "Min=av, standard: 112";
"Max=off, default: 164" = "Max=av, standard: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=tvinga NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Tvingar IRQ-kapacitet för alla NSF, inte bara NSF2";
"APU unmute on reset" = "APU avlyssning vid återställning";
"APU phase reset" = "APU fas återställning";
"APU non linear mixing" = "APU icke-linjär mixning";
"APU swap duty 1/2" = "APU byt duty 1/2";
"APU Initialize sweep unmute" = "APU initialisera sweep avlyssning";
"DMC enable $4011 writes" = "DMC aktivera $4011 skrivningar";
"DMC enable periodic noise" = "DMC aktivera periodiskt brus";
"DMC unmute on reset" = "DMC avlyssning vid återställning";
"DMC anti clicking" = "DMC anti-klickande";
"DMC non linear mixer" = "DMC icke-linjär mixer";
"DMC randomize noise on reset" = "DMC slumpmässigt brus vid återställning";
"DMC mute triangle on pitch 0" = "DMC tysta triangel vid tonhöjd 0";
"prevents high frequency aliasing" = "förhindrar högfrekvent aliasing";
"DMC rand. triangle" = "DMC slumpm. triangel";
"randomize triangle on reset" = "slumpmässig triangel vid återställning";
"DMC reverse bits" = "DMC omvänd bitar";
"reverse bits of DPCM sample bytes" = "omvända bitar av DPCM-sampelbytes";
"MMC5 non linear mixing" = "MMC5 icke-linjär mixning";
"MMC5 Phase reset" = "MMC5 fas återställning";
"Reset phase counter after write $5003 and $5007" = "Återställ fasräknare efter skrivning $5003 och $5007";
"FDS LP filter in Hz" = "FDS LP-filter i Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Brytfrekvens (0Hz=av, 2000Hz=standard)";
"FDS reset \"phase\"" = "FDS återställ \"fas\"";
"$4085 \"resets\" modular phase" = "$4085 \"återställer\" modulär fas";
"FDS write protect" = "FDS skrivskydd";
"write protect $8000-DFFF" = "skrivskydd $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 ersätt med OPLL";
"N163 Serial Multiplex mixing" = "N163 seriell multiplex-mixning";
"N163 Write Protect Phase" = "N163 skrivskydd fas";
"N163 Limit Wavelength" = "N163 begränsa våglängd";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Endast för HC-tillägg";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Panoreringsvärde";
"Gain value" = "Förstärkningsvärde";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Inaktivera";
"Enter playlist name" = "Ange spellistnamn";
"Ask" = "Fråga";
"Play All" = "Spela alla";
"Single" = "Enkel";
"Archive" = "Arkiv";
"On" = "På";
"Off" = "Av";
"Lim" = "Begr";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Lägg till spellista";
"Create a new playlist" = "Skapa ny spellista";
"Now playing" = "Spelar nu";
"1 entry" = "1 post";
"No entry" = "Ingen post";
"Random picks" = "Slumpmässigt urval";
"Generate a randomized playlist" = "Generera en slumpmässig spellista";
"Most played" = "Mest spelade";
"Favorites" = "Favoriter";

/* Playlist Actions */
"Add/Remove files..." = "Lägg till/Ta bort filer...";
"More actions..." = "Fler åtgärder...";
"Save as a new playlist" = "Spara som ny spellista";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Välkommen till Modizer!\n";
"Level up your library" = "Uppgradera ditt bibliotek";
"Sound meets visuals." = "Ljud möter grafik.";
"Made with passion,\noffered for free." = "Gjord med passion,\nerbjuden gratis.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Din ingång till retro- och trackermusik.\nFyll din enhet med legendariska spelmelodier, ikoniska trackermoduler och tidlösa chiptune-klassiker.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Bläddra och streama från onlinekataloger för att komplettera dina egna samlingar.\nSkapa, redigera och lyssna på spellistor enkelt.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Lås upp klassiska oscilloskop-utseenden, spektrumstaplar, pianorullar, trackervy och ProjectM/Milkdrop-FX. Låt Modizer måla varje spår med rörelse och färg.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Om du gillar appen är dricks ett utmärkt sätt att stödja dess fortsatta utveckling.\nTack för att du hjälper till att hålla Modizer vid liv och i utveckling.";

"Skip" = "Hoppa över";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Stöd med dricks";
"Enjoy Modizer ?" = "Gillar du Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Ditt stöd hjälper till att hålla Modizer igång och reklamfri!";
"Already tipped so far" = "Redan gett dricks hittills";
"Thank you for your support! ❤️" = "Tack för ditt stöd! ❤️";

/* Tip Tiers */
"Coffee" = "Kaffe";
"Coffee & Croissant" = "Kaffe & croissant";
"Dinner" = "Middag";
"Loading..." = "Laddar...";

/* Tip Actions */
"Confirm Tip" = "Bekräfta dricks";
"Send Tip" = "Skicka dricks";
"Send a %@ tip for %@?" = "Skicka %@ dricks för %@?";
"Tip" = "Dricks";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Kan inte ladda produkter. Kontrollera din internetanslutning.";

/* Thank You Alert */
"Thank You! ❤️" = "Tack! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Ditt stöd betyder allt! Tack för att du hjälper till att hålla Modizer igång.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Rensa databas";
"Clear 'Now Playing' queue" = "Rensa 'Spelar nu'-kö";
"Recreate Samples folder" = "Återskapa Samples-mapp";
"Reset settings to default" = "Återställ inställningar till standard";
"Remove current cover" = "Ta bort aktuellt omslag";
"Reset Ratings" = "Återställ betyg";
"Reset Played Counters" = "Återställ spelräknare";
"Reset Database" = "Återställ databas";
"Clear images cache" = "Rensa bildcache";

/* Maintenance Messages */
"Settings reseted" = "Inställningar återställda";
"Ratings reseted" = "Betyg återställda";
"Played Counters reseted" = "Spelräknare återställda";
"Samples folder created" = "Samples-mapp skapad";
"Cache cleaned" = "Cache rensat";
"Database reseted" = "Databas återställd";
"No cover to remove" = "Inget omslag att ta bort";
"Cover removed" = "Omslag borttaget";
"Database cleaned" = "Databas rensat";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Är du säker på att du vill rensa databasen, det kan ta en stund?";
"Clean" = "Rensa";
"Cleaning DB" = "Rensar databas";
"Cancelling..." = "Avbryter...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Stäng FX\nfönster";
"All FX off" = "Alla FX av";
"FX\nalpha" = "FX\nalfa";
"Show name\ntemp." = "Visa namn\ntillfälligt";
"Show name" = "Visa namn";
"Bundled\npresets" = "Medföljande\nförinställningar";
"Custom\npresets" = "Anpassade\nförinställningar";
"Blend\npresets" = "Blanda\nförinställningar";
"Clear\nall" = "Rensa\nalla";
"Select\nall" = "Välj\nalla";
"Favorites" = "Favoriter";
"Expand" = "Expandera";
"Select\nlisted" = "Välj\nlistade";
"Remove\nlisted" = "Ta bort\nlistade";
"Selected" = "Valda";
"Collapse" = "Kollapsa";
"Labels" = "Etiketter";
"Grid" = "Rutnät";
"Voices\nlabels" = "Röst\netiketter";
"Octaves\nlabels" = "Oktav\netiketter";
"Volume\nbars" = "Volym\nstaplar";
"Fixed bar" = "Fast stapel";
"BG\nopacity" = "BG\nopacitet";
"Bloom:\n%s" = "Bloom:\n%s";
"Thickness:\n%s" = "Tjocklek:\n%s";
"Font size\n%s" = "Teckenstorlek\n%s";
"Font:\n%s" = "Teckensnitt:\n%s";
"Info HUD:\n%s" = "Info HUD:\n%s";
"Select active %s presets" = "Välj aktiva %s förinställningar";
"bundled" = "medföljande";
"custom" = "anpassade";
"Select\ncustom\npresets" = "Välj\nanpassade\nförinställningar";
"Select\nbundled\npresets" = "Välj\nmedföljande\nförinställningar";
"Themes:\n%s" = "Teman:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Spela musik i Modizer";
"Start random playlist in Modizer" = "Starta slumpmässig spellista i Modizer";
"Play favorites in Modizer" = "Spela favoriter i Modizer";
"Start favorites playlist in Modizer" = "Starta favoritspellista i Modizer";
"Play most played in Modizer" = "Spela mest spelade i Modizer";
"Start most played playlist in Modizer" = "Starta mest spelade spellista i Modizer";
"Play a playlist in Modizer" = "Spela en spellista i Modizer";
"Start a playlist in Modizer" = "Starta en spellista i Modizer";
"Toggle shuffle mode in Modizer" = "Växla blandningsläge i Modizer";
"Change shuffle mode in Modizer" = "Ändra shuffle i Modizer";
"Change loop mode in Modizer" = "Ändra upprepningsläge i Modizer";
"Toggle repeat in Modizer" = "Växla upprepning i Modizer";
"What's playing in Modizer" = "Vad spelar i Modizer";
"Current song in Modizer" = "Nuvarande låt i Modizer";

"Voices commands aren't supported in MacOS." = "Röstkommandon stöds inte i macOS.";

/* Error messages */
"playlist_not_found_error" = "Spellista hittades inte. Använd 'Hämta spellistor' för att se tillgängliga spellistor.";
"playlist_empty_error" = "Denna spellista har inga poster. Lägg till musik först.";
